# GetNumBuildingStoreys Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFCUtils..::..GetNumBuildingStoreys Method
ExporterIFCUtils Class See Also
---
Returns the number of non-empty, non-duplicate building stories in the file.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static int GetNumBuildingStoreys(
	ExporterIFC exporterIFC
)
```

Visual Basic
---
```text
Public Shared Function GetNumBuildingStoreys ( _
	exporterIFC As ExporterIFC _
) As Integer
```

Visual C++
---
```text
public:
static int GetNumBuildingStoreys(
	ExporterIFC^ exporterIFC
)
```

# ### Parameters
exporterIFC
    Type: Autodesk.Revit.DB.IFC..::..ExporterIFC The exporter.
# ### Return Value
The number of stories.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace